<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"Staging","backend":"a060c5a2a149fe6a0c0c5938abaec1ef60fb5d0cdfa58757421b214087470eef","plan_job_ref":"Job Staging Image Build & Push #19 at https://github.com/IrezD/python-fastAPI-docker-image-v2/actions/runs/7348978683","plan_hash":"bb41dbf75e384d2a1ccadb4b324146e10ee36448ca7e937440e236bbab05798e","plan_text_format":"diff","version":"1.39.0","closed":true} -->
Terraform plan for __Staging__
<details>
<summary>Plan: 3 to add, 2 to change, 5 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-   destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.fastapi-service will be updated in-place
!~  resource "aws_ecs_service" "fastapi-service" {
        id                                 = "arn:aws:ecs:eu-central-1:806066816337:service/fastapi-cluster/dev-fastapi-service"
        name                               = "dev-fastapi-service"
        tags                               = {}
!~      task_definition                    = "arn:aws:ecs:eu-central-1:806066816337:task-definition/dev-fastapi-container:17" -> (known after apply)
#        (16 unchanged attributes hidden)

-       load_balancer {
-           container_name   = "dev_FastAPI_image" -> null
-           container_port   = 5000 -> null
-           target_group_arn = "arn:aws:elasticloadbalancing:eu-central-1:806066816337:targetgroup/alb-target-group-dev/e30cb86717c99c03" -> null
        }
+       load_balancer {
+           container_name   = "dev_FastAPI_image"
+           container_port   = 5000
+           target_group_arn = (known after apply)
        }

#        (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "task_definition" {
!~      arn                      = "arn:aws:ecs:eu-central-1:806066816337:task-definition/dev-fastapi-container:17" -> (known after apply)
!~      arn_without_revision     = "arn:aws:ecs:eu-central-1:806066816337:task-definition/dev-fastapi-container" -> (known after apply)
!~      container_definitions    = jsonencode(
!~          [
!~              {
-                   environment  = []
!~                  image        = "public.ecr.aws/p2x0k5a9/dev/irezd/fastapi:51d42c1ea2b434358b1c0f83fa662ccc0824bd77" -> "public.ecr.aws/p2x0k5a9/dev/irezd/fastapi:246104d51e71dd5077fdd05166c013d61520147b"
-                   mountPoints  = []
                    name         = "dev_FastAPI_image"
!~                  portMappings = [
!~                      {
-                           protocol      = "tcp"
#                            (2 unchanged attributes hidden)
                        },
                    ]
-                   volumesFrom  = []
#                    (3 unchanged attributes hidden)
                },
            ] # forces replacement
        )
!~      id                       = "*********************" -> (known after apply)
!~      revision                 = 17 -> (known after apply)
-       tags                     = {} -> null
#        (7 unchanged attributes hidden)
    }

  # aws_lb_listener.listerner will be created
+   resource "aws_lb_listener" "listerner" {
+       arn               = (known after apply)
+       certificate_arn   = "arn:aws:acm:eu-central-1:806066816337:certificate/ce157388-cd24-4841-9044-fbd2ab762400"
+       id                = (known after apply)
+       load_balancer_arn = "arn:aws:elasticloadbalancing:eu-central-1:806066816337:loadbalancer/app/fastapi-lb-dev/78fa42d138c4f3f0"
+       port              = 443
+       protocol          = "HTTPS"
+       ssl_policy        = "ELBSecurityPolicy-2016-08"
+       tags_all          = {
+           "Environment" = "Dev Environment"
        }

+       default_action {
+           order            = (known after apply)
+           target_group_arn = (known after apply)
+           type             = "forward"
        }
    }

  # aws_lb_listener.listerner_443 will be destroyed
  # (because aws_lb_listener.listerner_443 is not in configuration)
-   resource "aws_lb_listener" "listerner_443" {
-       arn               = "arn:aws:elasticloadbalancing:eu-central-1:806066816337:listener/app/fastapi-lb-dev/78fa42d138c4f3f0/213e8dd70975a398" -> null
-       certificate_arn   = "arn:aws:acm:eu-central-1:806066816337:certificate/ce157388-cd24-4841-9044-fbd2ab762400" -> null
-       id                = "arn:aws:elasticloadbalancing:eu-central-1:806066816337:listener/app/fastapi-lb-dev/78fa42d138c4f3f0/213e8dd70975a398" -> null
-       load_balancer_arn = "arn:aws:elasticloadbalancing:eu-central-1:806066816337:loadbalancer/app/fastapi-lb-dev/78fa42d138c4f3f0" -> null
-       port              = 443 -> null
-       protocol          = "HTTPS" -> null
-       ssl_policy        = "ELBSecurityPolicy-2016-08" -> null
-       tags              = {} -> null
-       tags_all          = {
-           "Environment" = "Dev Environment"
        } -> null

-       default_action {
-           order            = 1 -> null
-           target_group_arn = "arn:aws:elasticloadbalancing:eu-central-1:806066816337:targetgroup/alb-target-group-dev-443/4c3e823ca057454b" -> null
-           type             = "forward" -> null
        }

-       mutual_authentication {
-           ignore_client_certificate_expiry = false -> null
-           mode                             = "off" -> null
        }
    }

  # aws_lb_listener.listerner_80 will be destroyed
  # (because aws_lb_listener.listerner_80 is not in configuration)
-   resource "aws_lb_listener" "listerner_80" {
-       arn               = "arn:aws:elasticloadbalancing:eu-central-1:806066816337:listener/app/fastapi-lb-dev/78fa42d138c4f3f0/8e2ea1e10224ed45" -> null
-       id                = "arn:aws:elasticloadbalancing:eu-central-1:806066816337:listener/app/fastapi-lb-dev/78fa42d138c4f3f0/8e2ea1e10224ed45" -> null
-       load_balancer_arn = "arn:aws:elasticloadbalancing:eu-central-1:806066816337:loadbalancer/app/fastapi-lb-dev/78fa42d138c4f3f0" -> null
-       port              = 80 -> null
-       protocol          = "HTTP" -> null
-       tags              = {} -> null
-       tags_all          = {
-           "Environment" = "Dev Environment"
        } -> null

-       default_action {
-           order            = 1 -> null
-           target_group_arn = "arn:aws:elasticloadbalancing:eu-central-1:806066816337:targetgroup/alb-target-group-dev/e30cb86717c99c03" -> null
-           type             = "forward" -> null
        }
    }

  # aws_lb_target_group.target_group will be created
+   resource "aws_lb_target_group" "target_group" {
+       arn                                = (known after apply)
+       arn_suffix                         = (known after apply)
+       connection_termination             = (known after apply)
+       deregistration_delay               = "300"
+       id                                 = (known after apply)
+       ip_address_type                    = (known after apply)
+       lambda_multi_value_headers_enabled = false
+       load_balancing_algorithm_type      = (known after apply)
+       load_balancing_cross_zone_enabled  = (known after apply)
+       name                               = "alb-target-group-dev"
+       name_prefix                        = (known after apply)
+       port                               = 5000
+       preserve_client_ip                 = (known after apply)
+       protocol                           = "HTTPS"
+       protocol_version                   = (known after apply)
+       proxy_protocol_v2                  = false
+       slow_start                         = 0
+       tags_all                           = {
+           "Environment" = "Dev Environment"
        }
+       target_type                        = "ip"
+       vpc_id                             = "*********************"
    }

  # aws_lb_target_group.target_group_P-5000 will be destroyed
  # (because aws_lb_target_group.target_group_P-5000 is not in configuration)
-   resource "aws_lb_target_group" "target_group_P-5000" {
-       arn                                = "arn:aws:elasticloadbalancing:eu-central-1:806066816337:targetgroup/alb-target-group-dev/e30cb86717c99c03" -> null
-       arn_suffix                         = "targetgroup/alb-target-group-dev/e30cb86717c99c03" -> null
-       deregistration_delay               = "300" -> null
-       id                                 = "arn:aws:elasticloadbalancing:eu-central-1:806066816337:targetgroup/alb-target-group-dev/e30cb86717c99c03" -> null
-       ip_address_type                    = "ipv4" -> null
-       lambda_multi_value_headers_enabled = false -> null
-       load_balancing_algorithm_type      = "round_robin" -> null
-       load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> null
-       name                               = "alb-target-group-dev" -> null
-       port                               = 5000 -> null
-       protocol                           = "HTTP" -> null
-       protocol_version                   = "HTTP1" -> null
-       proxy_protocol_v2                  = false -> null
-       slow_start                         = 0 -> null
-       tags                               = {} -> null
-       tags_all                           = {
-           "Environment" = "Dev Environment"
        } -> null
-       target_type                        = "ip" -> null
-       vpc_id                             = "vpc-03bbe4ad4b29d26b9" -> null

-       health_check {
-           enabled             = true -> null
-           healthy_threshold   = 5 -> null
-           interval            = 30 -> null
-           matcher             = "200" -> null
-           path                = "/" -> null
-           port                = "traffic-port" -> null
-           protocol            = "HTTP" -> null
-           timeout             = 5 -> null
-           unhealthy_threshold = 2 -> null
        }

-       stickiness {
-           cookie_duration = 86400 -> null
-           enabled         = false -> null
-           type            = "lb_cookie" -> null
        }

-       target_failover {}

-       target_health_state {}
    }

  # aws_lb_target_group.target_group_P-5001 will be destroyed
  # (because aws_lb_target_group.target_group_P-5001 is not in configuration)
-   resource "aws_lb_target_group" "target_group_P-5001" {
-       arn                                = "arn:aws:elasticloadbalancing:eu-central-1:806066816337:targetgroup/alb-target-group-dev-443/4c3e823ca057454b" -> null
-       arn_suffix                         = "targetgroup/alb-target-group-dev-443/4c3e823ca057454b" -> null
-       deregistration_delay               = "300" -> null
-       id                                 = "arn:aws:elasticloadbalancing:eu-central-1:806066816337:targetgroup/alb-target-group-dev-443/4c3e823ca057454b" -> null
-       ip_address_type                    = "ipv4" -> null
-       lambda_multi_value_headers_enabled = false -> null
-       load_balancing_algorithm_type      = "round_robin" -> null
-       load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> null
-       name                               = "alb-target-group-dev-443" -> null
-       port                               = 5000 -> null
-       protocol                           = "HTTPS" -> null
-       protocol_version                   = "HTTP1" -> null
-       proxy_protocol_v2                  = false -> null
-       slow_start                         = 0 -> null
-       tags                               = {} -> null
-       tags_all                           = {
-           "Environment" = "Dev Environment"
        } -> null
-       target_type                        = "ip" -> null
-       vpc_id                             = "vpc-03bbe4ad4b29d26b9" -> null

-       health_check {
-           enabled             = true -> null
-           healthy_threshold   = 5 -> null
-           interval            = 30 -> null
-           matcher             = "200" -> null
-           path                = "/" -> null
-           port                = "traffic-port" -> null
-           protocol            = "HTTPS" -> null
-           timeout             = 5 -> null
-           unhealthy_threshold = 2 -> null
        }

-       stickiness {
-           cookie_duration = 86400 -> null
-           enabled         = false -> null
-           type            = "lb_cookie" -> null
        }

-       target_failover {}

-       target_health_state {}
    }

  # aws_security_group.internet_to_ALB will be updated in-place
!~  resource "aws_security_group" "internet_to_ALB" {
        id                     = "sg-052ce8f0ae0d6fabe"
!~      ingress                = [
-           {
-               cidr_blocks      = [
-                   "0.0.0.0/0",
                ]
-               description      = "Inbound from Internet to ALB"
-               from_port        = 80
-               ipv6_cidr_blocks = [
-                   "::/0",
                ]
-               prefix_list_ids  = []
-               protocol         = "tcp"
-               security_groups  = []
-               self             = false
-               to_port          = 80
            },
#            (1 unchanged element hidden)
        ]
        name                   = "internet-to-alb-dev"
        tags                   = {}
#        (7 unchanged attributes hidden)
    }

Plan: 3 to add, 2 to change, 5 to destroy.
```
</details>

:x: Error applying plan in [Staging Image Build & Push #19](https://github.com/IrezD/python-fastAPI-docker-image-v2/actions/runs/7348978683)